# IsValidZoomLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableData..::..IsValidZoomLevel Method
TableData Class See Also
---
Verifies if the value of zoom level is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public bool IsValidZoomLevel(
	int zoomLevel
)
```

Visual Basic
---
```text
Public Function IsValidZoomLevel ( _
	zoomLevel As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidZoomLevel(
	int zoomLevel
)
```

# ### Parameters
zoomLevel
    Type: System..::..Int32 The value of zoom level.
# ### Return Value
True if the value of zoom level is inside of the acceptable range, false otherwise.
# See Also
TableData Class
Autodesk.Revit.DB Namespace